{
  "title": "How GoTenderly Works   Complete Guide",
  "authorName": "Ahmed Zulfiqar",
  "image": "/business-dashboard.png",
  "pubDate": "2025-11-15T00:00:00.000Z",
  "description": "A practical, step-by-step guide that explains how GoTenderly (Qatar Tender Platform) works for procuring teams and suppliers   from publishing a tender to awarding the contract.",
  "content": "<h2 class=\"text-4xl font-semibold\">Overview</h2><p class=\"mt-4 text-base text-gray-700\">GoTenderly is a purpose-built tendering platform for Qatar projects that streamlines every stage of procurement: publishing opportunities, managing clarifications, accepting structured submissions, evaluating bids, and awarding contracts   all with a clear audit trail. This article explains exactly how the platform works for both procuring teams and suppliers, with practical steps, templates, and platform tips you can use today.</p><h2 class=\"mt-8 text-3xl font-bold text-gray-800\">How GoTenderly Works   Step by Step</h2><ol class=\"mt-6 space-y-6 list-decimal list-inside\"><li><strong class=\"text-gray-800 font-semibold\">Account setup (Buyers and Suppliers)</strong><p class=\"mt-2 text-gray-600\">Create an account (organization or individual). Buyers complete organization profile, procurement contact, and approval workflow. Suppliers complete company profile, attach trade license, classification, and bank/finance summary for pre-qualification.</p></li><li><strong class=\"text-gray-800 font-semibold\">Create &amp; publish a tender</strong><p class=\"mt-2 text-gray-600\">Buyers fill a guided tender form: title, reference, SoW, BoQ upload, mandatory documents, submission deadline, and evaluation criteria. Optionally add tags (construction, IT, FM, qatar) and attach Annex templates. Use the built-in editor or upload your existing tender document   GoTenderly automatically extracts key dates and fields for indexing.</p></li><li><strong class=\"text-gray-800 font-semibold\">Pre-qualification &amp; shortlist (optional)</strong><p class=\"mt-2 text-gray-600\">If required, enable a PQ stage. Suppliers submit qualification packs (certificates, financials). The buyer reviews and shortlists directly on the platform, with auto-generated PQ reports for auditors.</p></li><li><strong class=\"text-gray-800 font-semibold\">Q&amp;A and clarifications</strong><p class=\"mt-2 text-gray-600\">Suppliers ask questions in the tender Q&amp;A panel. Buyers answer once and publish answers to all registered bidders. GoTenderly timestamps every question and answer and notifies affected suppliers automatically.</p></li><li><strong class=\"text-gray-800 font-semibold\">Structured submissions</strong><p class=\"mt-2 text-gray-600\">Suppliers submit using the platform’s structured file layout (Commercial, Technical, Compliance). GoTenderly validates file types, required attachments, and passes initial compliance checks before allowing submission   preventing common disqualification causes.</p></li><li><strong class=\"text-gray-800 font-semibold\">Evaluation workflow</strong><p class=\"mt-2 text-gray-600\">Buyers create an evaluation panel, assign evaluators, and upload scoring rubrics. Evaluators score independently; GoTenderly calculates weighted scores (technical, commercial, delivery, local content) and highlights pass/fail gates. Redacted commercial bids can be used to preserve impartiality during technical scoring.</p></li><li><strong class=\"text-gray-800 font-semibold\">Recommendation &amp; award</strong><p class=\"mt-2 text-gray-600\">After scoring, the system generates a ranked recommendation, audit-ready evaluation report, and an editable award letter. Once approved through the buyer’s internal workflow, the award is published and notifications are sent to winners and unsuccessful bidders with debrief templates available on demand.</p></li><li><strong class=\"text-gray-800 font-semibold\">Contract management (post-award)</strong><p class=\"mt-2 text-gray-600\">GoTenderly offers contract templates, milestone tracking, invoice &amp; payment schedules, and performance dashboards. Notices, LD calculations, and warranty tracking are stored with the original tender record.</p></li></ol><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Key Features (What Makes GoTenderly Different)</h2><ul class=\"mt-6 space-y-3 ml-6 list-disc list-inside text-gray-600\"><li><strong class=\"text-gray-800\">Guided tender creation:</strong> stepwise form that extracts dates and key fields for indexing and alerts.</li><li><strong class=\"text-gray-800\">Structured submissions:</strong> required folder structure, automated checks, and resume/auto-fill for returning bidders.</li><li><strong class=\"text-gray-800\">Integrated Q&amp;A with audit trail:</strong> publish once to all bidders and keep a transparent Q&amp;A history.</li><li><strong class=\"text-gray-800\">Evaluator workspace:</strong> blind scoring, rubric templates, and auto-weighted results with audit-ready export.</li><li><strong class=\"text-gray-800\">Notifications &amp; alerts:</strong> email, SMS and in-platform, plus calendar sync for key dates.</li><li><strong class=\"text-gray-800\">Templates &amp; downloads:</strong> price schedules, bidder declarations, contract samples, and BoQ templates included.</li><li><strong class=\"text-gray-800\">Security &amp; compliance:</strong> role-based access, 2FA, encrypted storage, and document access logs.</li><li><strong class=\"text-gray-800\">Reporting &amp; analytics:</strong> tender pipelines, supplier activity, bid success rates, and spend analytics.</li></ul><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">How Suppliers Use GoTenderly   Quick Checklist</h2><p class=\"mt-4 text-base text-gray-700\">A supplier-focused checklist to prepare and submit bids using the platform.</p><ul class=\"mt-6 space-y-3 ml-6 list-disc list-inside text-gray-600\"><li>Complete company profile, upload trade license and classification documents.</li><li>Subscribe to relevant tags and set tender alerts for categories you target.</li><li>Pre-load CVs, templates, and bank references for fast submission.</li><li>Use the platform’s price schedule template to ensure correct format and currency.</li><li>Use the Q&amp;A panel for clarifications and check published answers before submitting.</li><li>Run the platform validation checks (Commercial, Technical, Compliance)   fix flagged items before final submission.</li><li>Download the submission receipt and keep the timestamped audit record for your files.</li></ul><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Integrations &amp; Exports</h2><p class=\"mt-4 text-base text-gray-700\">GoTenderly integrates with common procurement and office tools so teams can work with familiar systems:</p><ul class=\"mt-6 ml-6 list-disc list-inside text-gray-600 space-y-2\"><li>Calendar (ICS) export for deadlines and events</li><li>CSV / Excel export for BoQs and evaluation results</li><li>API access for ERP or finance systems (award &amp; invoice handoff)</li><li>Email/SMS gateway for supplier notifications</li></ul><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Security, Access &amp; Audit</h2><p class=\"mt-4 text-base text-gray-700\">Security and traceability are built-in: role-based access controls, two-factor authentication, encrypted document storage, and immutable activity logs (publish, edit, question, answer, submission, evaluation). Every action is timestamped and exportable for legal or audit review.</p><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Pricing &amp; Plans (Example)</h2><p class=\"mt-4 text-base text-gray-700\">We offer tiered plans to match organisation size and needs:</p><ul class=\"mt-6 ml-6 list-disc list-inside text-gray-600 space-y-2\"><li><strong class=\"text-gray-800\">Starter:</strong> 1 procurement user, basic tender publishing, supplier database, essential templates.</li><li><strong class=\"text-gray-800\">Business:</strong> multi-user workflows, PQ stage, evaluator workspace, reporting exports.</li><li><strong class=\"text-gray-800\">Enterprise:</strong> API access, SSO, custom SLAs, dedicated onboarding and priority support.</li></ul><p class=\"mt-3 text-sm text-gray-600\">(Contact sales for volume pricing and custom integrations.)</p><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Platform Tips for Faster Results</h2><ul class=\"mt-6 space-y-3 ml-6 list-disc list-inside text-gray-600\"><li>Tag tenders clearly (sector + location) to improve discoverability for qualified suppliers.</li><li>Attach evaluation rubrics and weightings at publish time to reduce clarifications and speed evaluation.</li><li>Use redacted commercial bids during technical scoring to keep evaluations impartial.</li><li>Publish Q&amp;A answers publicly and on time to reduce disputes after award.</li></ul><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Common Questions</h2><ul class=\"mt-6 space-y-3 ml-6 list-disc list-inside text-gray-600\"><li><strong class=\"text-gray-800\">Can I import old tender documents?</strong><p class=\"mt-2 text-gray-600\">Yes   upload your document and use the guided form to extract key fields and attach original files.</p></li><li><strong class=\"text-gray-800\">How does GoTenderly prevent late submissions?</strong><p class=\"mt-2 text-gray-600\">All submissions are timestamped. Late uploads are blocked after the configured deadline; administrators can export audit logs showing exact submission times.</p></li><li><strong class=\"text-gray-800\">Is data stored in Qatar?</strong><p class=\"mt-2 text-gray-600\">GoTenderly supports regional hosting options; for government work, choose the Qatar-hosted tenancy to meet local data rules.</p></li></ul><h2 class=\"mt-10 text-3xl font-bold text-gray-800\">Final Notes</h2><p class=\"mt-4 text-base text-gray-700\">GoTenderly reduces manual work, improves fairness and traceability, and helps both buyers and suppliers move through the tender lifecycle faster and with fewer errors. Use the guided templates, structured submissions, and evaluator tools to tighten your procurement process and create audit-ready outcomes.</p><p class=\"mt-6 italic text-gray-500\"><em>  </em></p>"
}
